{"aboutMeLabel":"About me","aboutMeParagraph":"My name is Mohammadreza Shekohi. I was born and raised in Fasa, located in Fars Province, Iran. I have loved being around computers for as long as I can remember. I'm naturally curious about new things and can never pass up the opportunity to learn more about them. When I say learning, I mean diving deep into the concepts. I’ve never been able to say I am fully knowledgeable in any field, as I always find myself passionate about learning more and becoming better than I was the day before. I’m also very ambitious, which drives me to constantly strive to be the best and to accomplish tasks to the highest standard.","aboutMeTitle":"Know me better","also":"Also","azhmanDesc":"I've been given the responsibility to develop an online food delivery web application as part of my first professional experience at a software company. I learned many things, not just technical skills. This opportunity improved my problem-solving and debugging skills in challenging situations, and I was taught the importance of being dedicated to a project.","azhmanFrom":"Aug 2023","azhmanPos":"Fullstack developer (Reactjs | Nextjs | .Net core)","azhmanTitle":"Azhman software company","azhmanTo":"Dec 2023","comming":"More are comming ...","cSharpDesc":"It’ll make you fall in love with Object Oriented Programming","cssDesc":"What is a world without love or an app without CSS?","dotNetDesc":"Takes applications to the Enterprise level","experiencesTitle":"Experiences","footer":"Created By ❤️ & ","fullStackDeveloper":"Full-Stack developer","htmlDesc":"Of course there is HTML","javascriptDesc":"The one and only key to the magical web frameworks wonderland\nAnd where it all actually began","nextDescFirst":"Speed of static pages & Power of React interactivity","nextDescLast":"Masterpiece","projectHandlingLabel":"How i handle projects","projectHandlingParagraph":"When I'm working on a project from scratch, I tend to choose the best technology suited to achieve the goal in the most effective way. After the initial project setup, I create custom components to use throughout the project. For instance, for modal components, I develop a base modal component without styles, called BaseModal. Whenever I need a modal, I use the BaseModal and pass my custom styles into it. I break larger problems into smaller ones and encapsulate each small problem into its own function or method, which I then use to solve the main problem. I write my code in a clean and expandable way, and I avoid coupling components or code too tightly together to ensure flexibility and maintainability.","reactDesc":"A library among the strongest frameworks!","sqlServerDesc":"Hold's up to your data","summaryParagraph":"I'm a passionate developer with hands-on experience in ASP.NET Core, ReactJS, and NextJS. I enjoy building smooth, user-friendly web applications and love working with these technologies. I always try to stay up-to-date with the latest trends to keep improving. I'm all about writing clean code and working closely with teams to get projects done right.","summaryTitle":"Summary","tailwindDesc":"A trusty companion in adventures of Vast CSS world","techStackTitle":"Awesome Tech Stack","theEndBody":"Definitely not — there are whole lot more I'm planning to learn and work with.","theEndTitle":"That was the end of it?"}