{"aboutMeLabel":"درباره من","aboutMeParagraph":"من محمدرضا شکوهی هستم. من در فسا، واقع در استان فارس، ایران به دنیا آمدم و بزرگ شدم. از زمانی که به یاد دارم عاشق این بودم که در کنار کامپیوتر باشم. من به طور طبیعی در مورد چیزهای جدید کنجکاو هستم و هرگز نمی توانم فرصت کسب اطلاعات بیشتر در مورد آنها را از دست بدهم. وقتی می گویم یادگیری، منظورم غواصی عمیق در مفاهیم است. من هرگز نتوانستم بگویم که در هیچ زمینه ای کاملاً آگاه هستم، زیرا همیشه علاقه مند به یادگیری بیشتر و بهتر شدن نسبت به روز قبل هستم. من همچنین بسیار جاه طلب هستم، که باعث می شود دائماً تلاش کنم تا بهترین باشم و وظایف را با بالاترین استاندارد انجام دهم.","aboutMeTitle":"منو بهتر بشناس","also":"همچنین","azhmanDesc":"به عنوان بخشی از اولین تجربه حرفه ای خود در یک شرکت نرم افزاری، مسئولیت توسعه یک برنامه وب تحویل آنلاین غذا به من داده شده است. من چیزهای زیادی یاد گرفتم، نه فقط مهارت های فنی. این فرصت مهارت های حل مسئله و اشکال زدایی من را در موقعیت های چالش برانگیز بهبود بخشید و اهمیت اختصاص دادن به یک پروژه را به من آموختند.","azhmanFrom":"آگوست 2023","azhmanPos":"توسعه دهنده Fullstack (Reactjs | Nextjs | هسته Net)","azhmanTitle":"شرکت نرم افزاری آژمان","azhmanTo":"دسامبر 2023","comming":"بیشتر در راه است ...","cSharpDesc":"این شما را عاشق برنامه نویسی شی گرا می کند","cssDesc":"دنیای بدون عشق یا برنامه بدون CSS چیست؟","dotNetDesc":"برنامه ها را به سطح Enterprise می برد","experiencesTitle":"تجربیات","footer":"ایجاد شده توسط ❤️ & ","fullStackDeveloper":"توسعه دهنده Full-Stack","htmlDesc":"البته HTML وجود دارد","javascriptDesc":"تنها کلید چارچوب های وب جادویی سرزمین عجایب و از کجا شروع شد","nextDescFirst":"سرعت صفحات استاتیک و تعامل با قدرت واکنش","nextDescLast":"شاهکار","projectHandlingLabel":"چگونه پروژه ها را مدیریت می کنم","projectHandlingParagraph":"وقتی از ابتدا روی پروژه ای کار می کنم، تمایل دارم بهترین فناوری را انتخاب کنم که برای رسیدن به هدف به مؤثرترین روش مناسب است. پس از راه اندازی اولیه پروژه، من اجزای سفارشی را برای استفاده در کل پروژه ایجاد می کنم. به عنوان مثال، برای مؤلفه‌های مدال، من یک مؤلفه مدال پایه بدون استایل به نام BaseModal توسعه می‌دهم. هر زمان که به یک مدال نیاز داشته باشم، از BaseModal استفاده می کنم و سبک های سفارشی خود را به آن منتقل می کنم. من مسائل بزرگتر را به مسائل کوچکتر تقسیم می کنم و هر مسئله کوچک را در تابع یا روش خودش کپسوله می کنم که سپس برای حل مشکل اصلی از آن استفاده می کنم. من کد خود را به روشی تمیز و قابل گسترش می نویسم و از جفت کردن مؤلفه ها یا کدهای خیلی محکم با هم برای اطمینان از انعطاف پذیری و نگهداری خودداری می کنم.","reactDesc":"کتابخانه ای در میان قوی ترین چارچوب ها!","sqlServerDesc":"اطلاعات خود را حفظ کنید","summaryParagraph":"من یک توسعه دهنده پرشور با تجربه عملی در ASP.NET Core، ReactJS، و NextJS هستم. من از ساختن برنامه های کاربردی وب روان و کاربرپسند لذت می برم و عاشق کار با این فناوری ها هستم. من همیشه سعی می کنم با آخرین روندها به روز باشم تا به بهبود ادامه دهم. من تماماً در مورد نوشتن کدهای تمیز و همکاری نزدیک با تیم ها برای انجام درست پروژه ها هستم.","summaryTitle":"خلاصه","tailwindDesc":"یک همراه قابل اعتماد در ماجراهای دنیای گسترده CSS","techStackTitle":"پشته فناوری عالی","theEndBody":"قطعاً نه - چیزهای بیشتری وجود دارد که من قصد دارم با آنها یاد بگیرم و با آنها کار کنم.","theEndTitle":"این پایان کار بود؟"}